import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Main {
    public static void main(String[] args) {
        //Данны массив и список
        int[] array = {10, 2, 10, 3, 1, 2, 5};//массив
        List<Integer> list = Arrays.asList(10, 2, 10, 3, 1, 2, 5);//список
        //вывести в консоль максимум, минимум и сумму всех элементов массива
        //вывести в консоль максимум, минимум и сумму всех элементов списка



        //реализовать сортировку массива по возрастанию пузырьковым методом
        //напишите ваш код тут

        //реализовать сортировку списка по возрастанию пузырьковым методом
        //напишите ваш код тут


        //выводим в консоль отсортированный массив

        //выводим в консоль отсортированный список

        //бонусное задание на циклы: вывести в консоль нижнюю треугольную матрицу из звездочек:
        /*
         *
         **
         ***
         ****
         *****
         ******
         *******
         ********
         *********
         */
    }
}
